IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO3_GPIO3.xml
	<register id="GPIO3_SET_RIS_TRIG45" acronym="GPIO3_SET_RIS_TRIG45" offset="0x74" width="32" description="">
		<bitfield id="SETRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_RIS_TRIG45" acronym="GPIO3_CLR_RIS_TRIG45" offset="0x78" width="32" description="">
		<bitfield id="CLRRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_SET_FAL_TRIG45" acronym="GPIO3_SET_FAL_TRIG45" offset="0x7C" width="32" description="">
		<bitfield id="SETFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_FAL_TRIG45" acronym="GPIO3_CLR_FAL_TRIG45" offset="0x80" width="32" description="">
		<bitfield id="CLRFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_INTSTAT45" acronym="GPIO3_INTSTAT45" offset="0x84" width="32" description="">
		<bitfield id="STAT5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 4 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_DIR67" acronym="GPIO3_DIR67" offset="0x88" width="32" description="">
		<bitfield id="DIR7" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 7 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR6" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 6 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_OUT_DATA67" acronym="GPIO3_OUT_DATA67" offset="0x8C" width="32" description="">
		<bitfield id="OUT7" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 7 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT6" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 6 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_SET_DATA67" acronym="GPIO3_SET_DATA67" offset="0x90" width="32" description="">
		<bitfield id="SET7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 7 bits. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SET6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 6 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_DATA67" acronym="GPIO3_CLR_DATA67" offset="0x94" width="32" description="">
		<bitfield id="CLR7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLR6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_IN_DATA67" acronym="GPIO3_IN_DATA67" offset="0x98" width="32" description="">
		<bitfield id="IN7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 7 bits." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="IN6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO3_SET_RIS_TRIG67" acronym="GPIO3_SET_RIS_TRIG67" offset="0x9C" width="32" description="">
		<bitfield id="SETRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_RIS_TRIG67" acronym="GPIO3_CLR_RIS_TRIG67" offset="0xA0" width="32" description="">
		<bitfield id="CLRRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
