IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO3_GPIO3.xml
	<register id="GPIO3_SET_FAL_TRIG67" acronym="GPIO3_SET_FAL_TRIG67" offset="0xA4" width="32" description="">
		<bitfield id="SETFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_FAL_TRIG67" acronym="GPIO3_CLR_FAL_TRIG67" offset="0xA8" width="32" description="">
		<bitfield id="CLRFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_INTSTAT67" acronym="GPIO3_INTSTAT67" offset="0xAC" width="32" description="">
		<bitfield id="STAT7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 6 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_DIR8" acronym="GPIO3_DIR8" offset="0xB0" width="32" description="">
		<bitfield id="DIR8" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 8 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_OUT_DATA8" acronym="GPIO3_OUT_DATA8" offset="0xB4" width="32" description="">
		<bitfield id="OUT8" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 8 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_SET_DATA8" acronym="GPIO3_SET_DATA8" offset="0xB8" width="32" description="">
		<bitfield id="SET8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 8 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_DATA8" acronym="GPIO3_CLR_DATA8" offset="0xBC" width="32" description="">
		<bitfield id="CLR8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_IN_DATA8" acronym="GPIO3_IN_DATA8" offset="0xC0" width="32" description="">
		<bitfield id="IN8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO3_SET_RIS_TRIG8" acronym="GPIO3_SET_RIS_TRIG8" offset="0xC4" width="16" description="">
		<bitfield id="SETRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_RIS_TRIG8" acronym="GPIO3_CLR_RIS_TRIG8" offset="0xC8" width="16" description="">
		<bitfield id="CLRRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_SET_FAL_TRIG8" acronym="GPIO3_SET_FAL_TRIG8" offset="0xCC" width="16" description="">
		<bitfield id="SETFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_CLR_FAL_TRIG8" acronym="GPIO3_CLR_FAL_TRIG8" offset="0xD0" width="16" description="">
		<bitfield id="CLRFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO3_INTSTAT8" acronym="GPIO3_INTSTAT8" offset="0xD4" width="32" description="">
		<bitfield id="STAT8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
</module>